Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/animal_welfare_and_control/control_of_dogs.html.txt.tmx
Source language: en
Languages: ga

source: Under the Control of Dogs Act 1986, as amended by the Control of Dogs (Amendment) Act 1992, local authorities are responsible for the control of dogs
ga: Faoin Acht um Rialú Madraí 1986 arna leasadh ag an Acht um Rialú Madraí (Leasú) 1992, tá sé de dhualgas ar na húdaráis áitiúla smacht a choinneáil ar mhadraí

source: They have the power to appoint dog wardens, provide dog shelters, seize dogs, impose on-the-spot fines and take court proceedings against owners
ga: Tá an chumhacht ag na húdaráis áitiúla maoir mhadraí a cheapadh, dídean mhadraí a sholáthar, madraí a ghabháil, fíneáil a dhéanamh ar an spota agus an dlí a chur ar úinéirí

source: Local authorities may enter into agreements with each other to provide dog wardens and dog shelters
ga: Is féidir leis na húdaráis áitiúla dul isteach i gcomhaontú lena chéile le maoir mhadraí agus dídean mhadraí a sholáthar

source: Some local authorities may enter into agreements with the Irish Society for the Prevention of Cruelty to Animals (ISPCA) or, with permission from the Minister for Housing, Planning, Community and Local Government, a person or organisation connected with animal welfare to provide these services
ga: Is féidir leo freisin dul isteach i gcomhaontú le dreamanna ar nós Cumann na hÉireann um Chosaint Ainmhithe (ISPCA) nó, le cead ón Aire Tithíochta, Pleanála, Pobal agus Rialtais Áitiúil, dul i mbun comhaontaithe le haon duine nó aon eagraíocht a bhaineann le leas ainmhithe leis na seirbhísí seo a sholáthar

source: You are liable for injury or damage caused by your dog to people or livestock
ga: Tá tú freagrach as aon ghortú nó damáiste ar bith a dhéanann do mhadra do dhaoine nó do stoc

source: You can be disqualified from keeping a dog if you have been convicted of cruelty to a dog under the Protection of Animals Acts 1911 and 1965
ga: Is féidir bac a chur ort madra a choinneáil más rud é gur chúisíodh tú ar thurcántacht ar mhadra faoi na hAchtanna um Chosaint Ainmhithe 1911 agus 1965

source: A new system of compulsory microchipping was introduced in 2015 – see ‘Dog identification’ below
ga: Tugadh córas nua isteach i 2015 le madraí a mhicrishliseadh go h-éigeantach - féach 'Aitheantas madra' thíos

source: In order to get a dog licence, you must be over 16 years of age
ga: Caithfidh tú a bheith os cionn 16 bliana d'aois le ceadúnas madra a fháil

source: It is an offence to keep a dog unless you have a licence
ga: Is coir atá ann má tá madra agat, mura bhfuil ceadúnas agat

source: All dogs over 4 months of age must have a licence
ga: Is gá do gach madra os cionn 4 mhí d'aois ceadúnas a bheith aige

source: Puppies aged under 4 months who are still with their mothers don't need licences, but once they leave their mothers they must have a licence
ga: Ní gá do choileáin faoi bhun 4 mhí ceadúnas a bheith acu, ach nuair fágann siad a máthair, is gá dóibh ceadúnas

source: Your dog must be accompanied by and be under your effective control or the control of another responsible person if it is outside your home or premises or the home or premises of the person in charge of it
ga: Caithfidh an madra a bheith i gcuideachta agus a bheith faoi smacht éifeachtach duine éigin freagrach má tá an madra taobh amuigh den teach nó áitreabh nó taobh amuigh de theach nó áitreabh an duine atá i bhfeighil ar an ainmhí

source: A dog warden can ask you to produce evidence of your dog licence and failure to do so can result in an on-the-spot fine
ga: Is féidir leis an maor madra fianaise a iarraidh ort le taispeáint go bhfuil ceadúnas madra agat agus muna ndéanann tú sin is féidir tú a fhíneáil ar an spota

source: Failure to pay this fine within a specified period can result in prosecution by the local authority
ga: Muna n-íocann tú an fhíneáil seo laistigh den tréimhse atá leagtha síos, is féidir leis an údarás áitiúil tú a chúisiú

source: Licences are not needed for blind persons' guide dogs; for dogs in the possession of a local authority, the ISPCA or the Gardaí; or for any dog imported into the State for less than 30 days
ga: Ní gá ceadúnas do mhadraí treorach do dhaoine atá dall; do mhadraí atá i seilbh ag údarás áitiúil, ag Cumann na hÉireann um Chosaint Ainmhithe nó ag na Gardaí; ná d'aon mhadra iompórtáilte sa Stát ar feadh níos lú ná 30 lá

source: Standard annual licences for individual dogs are issued by post offices
ga: Is féidir gnáthcheadúnas bliantúil a fháil ag oifigí poist áitiúla

source: General dog licences for multiple dogs are issued by local authorities
ga: Eisíonn na h-údaráis áitiúla ceadúnais ghinearálta madra

source: The revenue from dog licences finances the operation of dog control services
ga: Téann an t-airgead ó cheadúnais mhadra ar aghaidh chun seirbhísí smachta madraí a mhaoiniú

source: The Dog Breeding Establishments Act 2010 introduced a 'lifetime of dog' licence, which is issued by local authorities
ga: Chuir an tAcht um Bunachais Pórúcháin Madraí 2010 ceadúnas 'saolré an mhadra' ar bun. Eisíonn na h-údaráis áitiúla na ceadúnais seo

source: Dogs must at all times wear a collar that bears the name and the address of the owner inscribed on it or on a plate, badge or disc
ga: Caithfidh madraí coiléar buan a chaitheamh le ainm agus seoladh an úinéara scríofa air nó is féidir é a bheith ar phláta, ar shuaitheantas nó ar dhiosc

source: Failure to have identification on a dog can result in an on-the-spot fine issued by a dog warden
ga: Muna bhfuil aitheantas de chineál éigin agat ar do mhadra is féidir leis an maor madra tú a fhíneáil ar an spota

source: Failure to pay this fine within a specific period can result in prosecution by the local authority
ga: Muna n-íocann tú an fhíneáil seo laistigh den thréimhse atá leagtha síos, is féidir tú a chúisiú

source: Under the Microchipping of Dogs Regulations 2015, a programme of microchipping has been introduced
ga: Faoi na Rialacháin um Micrishliseadh Madraí 2015, tugadh córas nua isteach le madraí a mhicrishliseadh go h-éigeantach

source: • Any pup born since 1 June 2015 must be microchipped and registered on an authorised database (pdf) by the time it reaches the age of 12 weeks or if it leaves the property on which it was born before the age of 12 weeks
ga: • Caitear gach hóga a rugadh ó 1 Meitheamh 2015 i leith a mhicrishliseadh agus a chlárú ar bhunachar sonraí atá údaraithe (pdf)

source: • Since 31 March 2016, the Regulations apply to all dogs
ga: • Ó 31 Márta 2016, tá na Rialacháin i nbhfeidhm i leith ghach madra

source: • If your dog is already microchipped, you now have to register it as well
ga: • Má tá do mhadra micrishliste cheana féin, tá ort anois é a chlárú freisin

source: Read more in this press release and in these Frequently Asked Questions (pdf)
ga: Faigh tuilleadh eolais sa phreasráiteas seo agus sna Ceisteanna Coitianta (pdf)

source: Stray dogs are dogs that are in a public place and are not accompanied by the owner or a responsible person
ga: 'Sé an rud atá i gceist le madraí seachráin, na madraí atá in áit phoiblí agus nach bhfuil an t-úinéir nó duine éigin freagrach ina gcuideachta

source: Dogs that are not under proper control are also considered stray dogs
ga: Glactar leis go bhfuil madraí ar seachrán muna bhfuil siad faoi smacht ceart

source: You can receive an on-the-spot fine if your dog is not under proper control
ga: Muna bhfuil do mhadra faoi smacht ceart, d’fhéadfadh fíneáil ar an spota a fháil

source: Stray dogs may be seized by the dog warden and the Gardaí and brought to a dog pound
ga: Is féidir leis an maor madraí agus na Gardaí, madraí atá ar seachrán a ghabháil agus iad a thabhairt go dtí an póna madraí áitiúil

source: These dogs may be put down or re-homed if their owners do not claim them within 5 days
ga: Is féidir na madraí seo a chur síos nó fáil réidh leo muna dtagann a n-úinéirí a n-iarraidh laistigh de thréimhse 5 lá

source: If your dog has strayed or is missing, you should contact the local dog pound directly to check if your dog is there
ga: Má tá madra agat atá ar strae nó caillte, ba cheart duit teagmháil a dhéanamh leis an bpóna madraí áitiúil chun seiceáil a dhéanamh ar ghabháladh é

source: Before you collect it, you will have to pay a re-claim fee and produce a current dog licence
ga: Sula mbaillíonn tú an madra, beidh ort táille athéilimh a íoc agus ceadúnas madra reatha a sholáthar

source: If you do not have a current dog licence, you must get one before collecting your dog
ga: Muna bhfuil ceadúnas madra reatha agat caithfidh tú ceann a cheannacht in oifig an phoist áitiúil sula mbaillíonn tú an madra

source: Unwanted dogs should be brought to the dog pound
ga: Ba cheart iad a thabhairt go dtí an póna madraí

source: There may be a charge for accepting them – check this with your local pound
ga: Gearrann pónaí áirithe táille as madra a ghlacadh - fiafraigh den phóna mar gheall ar seo

source: Local authorities have the power to accept unwanted dogs and put them down if they cannot be rehomed or transferred to an animal welfare group
ga: Tá sé de chumhacht ag an údarás áitiúil madraí a thógáil isteach agus iad a mharú nó fáil réidh leo muna bhfaightear áit fhóirstineach dóibh

source: Dog wardens have the power to request the name and address of a person suspected of an offence under the Control of Dogs Act
ga: Tá an chumhacht ag an maor madraí ainm agus seoladh a iarraidh ar an té atá in amhras maidir le coir faoin Acht um Rialú Madraí

source: They also have the power to seize and detain any dog and to enter any premises, other than a residence, to seize and detain a dog
ga: Tá an chumhacht acu madra a ghabháil agus é a choinneáil agus tá sé de chead acu dul isteach in aon áitreabh seachas áit chónaithe chun madra a ghabháil nó a thógáil

source: You are guilty of an offence and can be arrested by a Garda if you obstruct a dog warden in the course of his or her work, refuse to give your name and address or give a false name and address
ga: Tá tú ciontach ar choir agus is féidir leis na Gardaí tú a ghabháil má chuireann tú bac ar an maor madraí agus é nó í i mbun a gcuid oibre nó má dhiúltaíonn tú d' ainm agus do sheoladh a thabhairt nó ainm agus seoladh bréagach a thabhairt

source: Many local authorities have introduced bye-laws to indicate areas where dogs must be kept on a leash or even prohibited
ga: Tá go leor dlíthe curtha i bhfeidhm ag na húdaráis áitiúla a léiríonn na ceantair ina gcaithfear madraí a choinneáil ar iall nó na ceantair a bhfuil cosc iomlán ar mhadraí

source: Your local authority will be able to inform you of the bye-laws that apply in your area
ga: Beidh d'údarás áitiúil in ann tú a chur ar an eolas maidir leis na fodhlíthe atá i bhfeidhm i do cheantar

source: Breaches of these bye-laws can result in fines on summary conviction
ga: Má bhristear na fodhlíthe maidir le madraí i do cheantar, 'sé an toradh a bheidh air ná fíneáil ar chiontú achomaire

source: Under Section 22 of the Litter Pollution Act 1997 it is an offence to allow a dog under your control to foul a public place
ga: Faoi Alt 22 don Acht Truailliú Brúscair 1997 is coir atá ann cead a ligean do mhadra faoi do smacht áit phoiblí a shalú

source: This means the owner or person in charge of the dog is required to remove dog faeces and dispose of them in a suitable, sanitary manner
ga: Ciallaíonn sé seo de réir dlí, go bhfuil sé suas ag an úinéir nó an duine atá i bhfeighil ar an mhadra an fearadh a ghlanadh ar bealach atá cóir ó thaobh na sláintíochta de

source: You can complain to the District Court under the litter laws against an owner or someone in charge of a dog who allows that dog to foul public places and who fails to act responsibly
ga: Is féidir leat gearán a dhéanamh chuig an gCúirt Dúiche in aghaidh an úinéara nó duine atá i bhfeighil ar an mhadra a thugann cead do mhadra áit phoiblí a shalú agus nach dtógann freagracht as gníomhaíochtaí an mhadra

source: Before you do this, you must first inform the dog owner of your intention by completing a special form available from the Dog Control Unit of your local authority
ga: Caithfidh tú an t-úinéir a chur ar an eolas maidir leis an ghníomhaíocht atá i gceist agat tré foirm iarratais speisialta a líonadh isteach

source: Read more about litter laws
ga: Léigh tuilleadh faoi na dlithe brúscair

source: Excessive dog barking that causes a nuisance is an offence
ga: Is coir é nuair atá madra ag tafann an-iomarca agus é ina ábhar núis

source: You may be able to solve such problems by talking to the dog owner
ga: B’fhéidir go mbeidh tú in ann na fadhbanna sin a réiteach trí chaint le húinéir an mhadra

source: If you don’t get a satisfactory response, you may complain to the District Court and seek a hearing
ga: Mura bhfaigheann tú freagairt shásúil, féadfaidh tú gearán a dhéanamh leis an gCúirt Dúiche agus éisteacht a lorg

source: When you have received a court date, you must inform the dog owner of your complaint by using the form prescribed for this purpose under Section 25 of the Control of Dogs Act 1986
ga: Nuair a bhíonn dáta cúirte agat, ní mór duit úinéir an mhadra a chur ar an eolas faoi do ghearán tríd an bhfoirm a úsáid a fhorordaítear don chuspóir seo faoi Alt 25 den Acht um Rialú Madraí, 1986

source: These forms are available from the District Courts and from local authorities
ga: Tá fáil ar na foirmeacha seo ó na Cúirteanna Dúiche agus ó údaráis áitiúla

source: The court may make an order requiring the occupier of the premises in which the dog is kept to abate the nuisance by exercising due control over a dog
ga: Féadfaidh an chúirt ordú a dhéanamh a cheanglaíonn ar áititheoir an áitribh ina gcoimeádtar an madra chun deireadh a chur leis an núis trí mhadra a rialú go cuí

source: The court may limit the number of dogs that can be kept on a premises or may direct that a dog be delivered to a dog warden to be dealt with as unwanted
ga: Féadfaidh an chúirt líon na madraí is féidir a choimeád ar áitreabh a theorannú nó a ordú go dtugtar madra do mhaor madraí go ndéileálfar leis an madra mar mhadra gan iarraidh

source: A guard dog used at a non-residential business premises must be either accompanied by a handler or secured so that it cannot roam freely around the premises or escape
ga: Caithfidh duine éigin a bheith in éineacht le madra cosanta nó é a choinneáil sabháilte sa dóigh is nach féidir leis a bheith ag siúl thart saor nó nár féidir leis éalú, má tá sé in áit neamh-chónaithe

source: A notice must be displayed at the entrance, informing the public that a guard dog is on the premises
ga: Caithfear fógra a chrochadh ar an bhealach isteach leis an phobal a chur ar an eolas go bhfuil madra cosanta ar an láthair

source: The guard dog must wear a collar displaying the name and address of its owner
ga: Caithfidh an madra cosanta coiléar a chaitheamh ag tabhairt ainm agus seoladh an úinéara

source: It must also carry an electronic implant containing a permanent identification mark provided by the ISPCA
ga: Caithfidh an madra ionchlannán leictreonach a bheith ar a chorp le marc aitheantais buan air a tugadh don mhadra ón ISPCA

source: This implant must be inserted by or under the direct supervision of a veterinary surgeon authorised by the ISPCA
ga: Caithfidh an ionchlannán a bheith sáite sa mhadra faoi chúram dochtúir tréadliachta atá glactha leis ag an ISPCA

source: The dog owner is responsible for the cost involved in inserting the implant
ga: Tá úinéir an mhadra freagrach as na costais a bhaineann leis an ionchlannán

source: Kennels where more than 5 guard dogs aged over 4 months are kept must register with the local authority
ga: Má tá conchróite le níos mó na 5 mhadra cosanta agus iad níos mó ná 4 mhí d'aois, caithfear iad a chlárú leis an údarás áitiúil

source: There are specific rules on the keeping of guard dogs: the Control of Dogs Act 1986 (Guard Dog) Regulations 1989
ga: Léigh tuilleadh faoi na rialacha seo sna Rialacháin faoin Acht um Rialú Madraí 1986 (Madra Cosanta) 1989

source: Rules relating to certain breeds of dog
ga: Rialacha maidir le cineálacha póir madraí

source: The Control of Dogs Regulations 1998 impose additional rules in relation to the following breeds (and strains/cross-breeds) of dog:
ga: Cuireann Rialacháin um Rialú Madraí 1998 rialacha sa bhreis maidir le cineálacha póir madraí seo a leanas (agus tréithchineál/traspóradh)

source: • Be kept on a short strong lead by a person over 16 years who is capable of controlling them
ga: • Go gcaithfear na madraí seo (nó tréithchinéal agus traspóradh dóibh) a bheith coinnithe ar iallachta gairid láidir ag duine atá os cionn 16 bliana d'aois agus atá in ann smacht a choinneáil orthu

source: • Be muzzled whenever they are in a public place
ga: • Caithfear soc béil a chur ar na madraí ( nó tréithchinéal agus traspóradh dóibh) nuair atá siad in áit phoiblí

source: • Wear a collar bearing the name and address of their owner at all times
ga: • Caithfidh na madraí seo (nó tréithchinéal agus tras-póradh dóibh) coiléar a chaitheamh an t-am ar fad le ainm agus seoladh an úinéara

source: The rules on muzzling and leashing do not apply to dogs used by the Gardaí, the Dublin Harbour Police, State Airport Police and bona fide rescue teams in rescue operations
ga: Ní bhaineann na rialacha seo le madraí a úsaideann na Gardaí, Gardaí Calafoirt Bhaile Átha Cliath, Gardaí ar Aerfort Stáit agus foirne tarrthála bona fide agus iad i nbun gníomhaíochta sábháltachta

source: The rules on muzzling do not apply to guide dogs for the blind
ga: Ní bhaineann na rialacha maidir le soc béil leis na madraí treorach a bhíonn ag an dream atá dall

source: Local authorities have the power to introduce bye-laws relating to dog control
ga: Tá cumhacht ag údaráis áitiúla fodhlíthe maidir le rialú a thabhairt isteach

source: You should be aware that the penalties listed below are a guide; fines in your area may be higher
ga: Is treoir iad ná pionóis liosaithe thíos. D’fhéadfadh an fineálacha i do cheantar bheith níos airde

source: No dog licence On-the-spot fine: €100 payable to your local authority Failure to pay on-the-spot fines can lead to prosecution in District Court with a maximum fine of €2,500 and/or 3 months' imprisonment
ga: Gan ceadúnas madra Fíneáil ar an spota: €100 agus é iníoctha leis an údarás áitiúil Muna n-íocann tú an fhíneáil ar an spota is féidir tú a chúisiú sa Chúirt Dúiche le uasmhéid fíneála de €2,500 agus/nó téarma príosúnachta 3 mhí

source: No identification on dog On-the-spot fine: €100 payable to your local authority Failure to pay on-the-spot fines can lead to prosecution in District Court with a maximum fine of €2,500 and/or 3 months' imprisonment Stray dog Dog pound re-claim fee of €20
ga: Gan aitheantas ar an madra Fíneáil ar an spota: €100 agus é iníoctha leis an údarás áitiúil Muna n-íocann tú an fhíneáil ar an spota is féidir tú a chúisiú sa Chúirt Dúiche le uasmhéid fíneála de €2,500 agus/nó téarma príosúnachta 3 mhí

source: Charge of €8 for every night dog is in pound
ga: Madra ar strae Tá táille athéilimh de €20 ag an phóna madra

source: The pound will hold a dog for at least 5 days. Dogs not re-claimed from the dog pound within 5 days may be put down, rehomed or transferred to an animal welfare group
ga: Tá costas €8 in aghaidh na h-oíche a chaitheann an madra sa phóna Faightear réidh leo nó cuirtear síos madraí muna dtagann éinne a lorg i ndiaidh 5 lá

source: Dog not kept under control On-the-spot fine of €100 payable to your local authority Failure to pay on-the-spot fines can lead to prosecution in District Court with a maximum fine of €2,500 and/or 3 months' imprisonment
ga: Madraí nach gcoinnítear faoi smacht Fíneáil ar an spota €100 iníoctha leis an údarás áitiúil Muna n-íocann tú an fhíneáil ar an spota is féidir tú a chúisiú sa Chúirt Dúiche le uasmhéid fíneála de €2,500 agus/nó téarma príosúnachta 3 mhí

source: Breach of bye-laws (setting out times when dog may be unleashed in public) Fines up to €2,500 on conviction
ga: Ag briseadh fodhlíthe ( ag leagaint amach amanna gur féidir le madraí a bheith in áit phoiblí gan iall) Fíneáil suas go dtí €2,500 má chúisítear tú

source: Dog fouling public place Owners/handlers who do not dispose of dog faeces in a responsible manner may receive an on-the-spot fine of €150
ga: Madra ag salú in áit phoiblí Muna bhfaigheann úinéirí nó an duine atá i bhfeighil an madra réitigh don bhfearadh ar bealach atá freagrach is féidir leis / léi a bheith fíneáilte ar an spota €150

source: Failure to pay on-the-spot fines can lead to prosecution in District Court with a maximum fine of €3,000 and €600 per day for continuing offences on summary conviction
ga: Muna n-íocann tú an fhíneáil ar an spota is féidir tú a chúisiú sa Chúirt Dúiche le uasmhéid fíneála de €3,000 agus €600 sa lá do chiontí leanúnach

source: An individual dog licence costs €20 and is valid for one year
ga: Cosnaíonn ceadúnas madra €20 agus é dlisteanach do thréimhse bliana

source: A general dog licence costs €400 and is valid for one year
ga: Cosnaíonn ceadúnas ginearálta madra €400 agus é dlisteanach do thréimhse bliana

source: A 'lifetime of dog' licence costs €140
ga: Cosnaíonn ceadúnas 'saolré an mhadra' €140

source: The Department of Housing, Planning, Community and Local Government publishes detailed information on its website, including guidelines under the Dog Breeding Establishments Act and statistics on dog control
ga: Foilsíonn an Roinn Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil faisnéis mhionsonraithe ar a láithreán gréasáin, lena n-áirítear treoirlínte faoin Acht um Bunachais Pórúcháin Madraí agus faoi staitisticí ar rialú madraí

source: For a dog licence
ga: Chun ceadúnas a fháil

source: You can get an individual dog licence at your local post office
ga: Is féidir gnáthcheadúnas do mhadra aonair a fháil in oifig an phoist

source: For a general dog licence or a 'lifetime of dog' licence, apply to your local authority
ga: Má tá ceadúnas ginearálta madra nó ceadúnas 'saolré an mhadra' uait, iarr ar an údarás áitiúil

source: To microchip and register your dog
ga: Chun do mhadra a mhicrishliseadh agus a chlárú

source: Contact your vet or else one of the authorised databases (pdf)
ga: Déan teagmháil le do thréidlia nó le bunachar sonraí atá údaraithe (pdf)

source: Irish Society for the Prevention of Cruelty to Animals
ga: Cumann na hÉireann um Chosaint Ainmhithe
